//! start at p20初识操作符2
//*操作符 ~
/*#include <stdio.h>
int main(){
    int a = +0;
    int b = -0;
    printf("%d %d\n",~a,~b);//~ 按位取反
    return 0;
}*/
//结果为-1，~对原码（直接照着数字写二进制，符号位别忘记）的二进制位取反，把所有二进制位中的数字1变成0，0变成1，包括符号位
//整数0的二进制是32个0，取反变成32个1，这正好与-1的补码相同，%d输出原码的时候因此输出-1 (-0的补码和0一样所以也是-1)
//一个整数的二进制表示有三种：1.原码 2.反码 3.补码，而整数在内存中储存的是补码
 
//对于整数中的负数，适用于如下计算
//1.原码就是直接写出二进制序列，如-1，[1（符号位在最左边，符号位占一个bit，1是负数0是正数，后面是有效位）0000000000000000000000000000001]
//2.反码符号位不变其余取反           [111111111111111111111110]
//3.补码是把反码加1                 [111111111111111111111111]
//对于正整数来说三码相同，因此在内存中正整数直接储存

#include <stdio.h>
/*int main(){
    int a = 10;
    int b = ++a;//前置++ a先+1，然后把值赋给b（先赋值，后使用

    int a = 10;
    int b = a++;//后置++，先把a的值赋给b，a再+1（先使用，后赋值）
    printf("%d\n",b);
    printf("%d\n",a);
    return 0;
}*/

//*（类型）：强制类型转换
/*int main(){
    int a = (int)3.14;
    printf("%d\n",a);
    return 0;
}*/

//*关系操作符> >= < <= != ==
//*逻辑操作符 &&逻辑与(并且），||逻辑或
/*int main(){
    int a = 3;
    int b = 0;
    int c = a && b;
    int d = a || b;
    printf("%d %d\n",c,d);//&&并且里只要一个为0假输出为0假，两个都非0才是1
                          //||或中只要一个为真就是真
    return 0;
}*/

//*条件操作符（三目操作符）exp1 ? exp2 : exp3
//?exp1成立，exp2计算，整个表达式结构是exp2的结果
//?exp1不成立，exp3计算，整个表达式结构是exp3的结果
/*int main(){
    int a = 0;
    int b = 3;
    int max = 0;
    if(a>b)
        max = a;
    else
        max = b;
    max = a > b ? a : b;
    printf("max = %d\n",max);
    return 0;
}*/

//*逗号表达式：逗号隔开的一串表达式
/*int main(){
    int a = 0;
    int b = 3;
    int c = 5;
    int d =(a = b + 2,c = a - 4,b = c + 2);
    //?逗号表达式从左到右依次计算，整个表达式的结果是最后一个表达式的结果
    printf("% d\n",d);

    return 0;    
}*/

//*[]下标引用操作符
/*int main(){
    int arr[10] ={1,2,3,4,5,6,7,8,9,10};
    //?下标从0开始 0 1 2 3 4 5 
    printf("%d\n",arr[5]);
    return 0;
}*/

//*()函数调用操作符
int main(){
    //?调用函数的时候函数名后面的()就是函数调用操作符
    printf("hehe\n");

}

//!操作符 & * . -> 后面学习